tap "manaflow-ai/cmux"
tap "supabase/tap"
tap "symfony-cli/tap"

# ─── Formulae ───────────────────────────────────────────────────────────────
brew "bat"
brew "cloudflared"
brew "curlie"
brew "fd"
brew "git-delta"
brew "deno"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "jq"
brew "just"
brew "mkcert"
brew "mole"
brew "pure"
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "rtk"
brew "tlrc"
brew "tree"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "supabase/tap/supabase"
brew "symfony-cli/tap/symfony-cli"

# ─── Casks ──────────────────────────────────────────────────────────────────
cask "1password-cli"
cask "chromedriver"
cask "chromium"
cask "cmux"
cask "codex"
cask "cursor"
cask "ghostty"
cask "ollama-app"
cask "orbstack"
cask "raycast"
